trunk/app/controllers/lesson_material_controller.rb

  def index
    @files = LessonMaterial.find :all
---
SELECT "lesson_materials".* FROM "lesson_materials"

  def uploadFile
    unless params[:upload]
        flash[:notice] = 'Choose a file to upload'
        self.index
        return
    end

    unless params[:title] and params[:title] != ''
        flash[:notice] = 'Choose a title to your upload'
        self.index
        return
    end

    unless params[:discipline] and params[:discipline] != '' and params[:discipline] != 'EMPTY'
      flash[:notice] = 'Choose a discipline to your upload'
      self.index
      return
    end

    LessonMaterial.save(params[:upload], params[:title], params[:discipline], params[:comment])
---
INSERT INTO "lesson_materials" ("title", "file_name", "discipline", "created_at", "updated_at") VALUES ('Captura de Tela', 'Captura_de_tela.png', 'MAT', '2011-07-08 02:56:31.868683', '2011-07-08 02:56:31.868683')