trunk/app/controllers/search_controller.rb

SELECT "lesson_materials".* FROM "lesson_materials" WHERE (title LIKE '%%')
---
  def searchByTitle
      @str = params[:query]

      if @str == '' then
          self.index
          return
      end

      @query = @str.split

      @files = LessonMaterial.find :all

SELECT "lesson_materials".* FROM "lesson_materials" WHERE (discipline = 'POR')
---
  def searchByDiscipline
      @query = params[:queryD]

      if @query == 'EMPTY' then
          self.index
          return
      end

      @str = @query

      @files = LessonMaterial.where("discipline = '#{@query}'")