app/controllers/lesson_material_controller.rb

SELECT "lesson_materials".* FROM "lesson_materials"
---
  def index
    @files = LessonMaterial.find :all

INSERT INTO "lesson_materials" ("title", "file_name", "discipline", "created_at", "updated_at") VALUES ('Captura de Tela', 'Captura_de_tela.png', 'MAT', '2011-07-08 02:56:31.868683', '2011-07-08 02:56:31.868683')
---
  def uploadFile
    unless params[:upload]
        flash[:notice] = 'Escolha um arquivo'
        self.index
        return
    end
    LessonMaterial.save(params[:upload], params[:title])