app/controllers/search_controller.rb

  def searchByTitle
      @query = params[:query]
      @files = LessonMaterial.where("title LIKE '%#{@query}%'")
---
SELECT "lesson_materials".* FROM "lesson_materials" WHERE (title LIKE '%%')

  def searchByDiscipline
      @query = params[:queryD]
      @files = LessonMaterial.where("discipline = '#{@query}'")
---
SELECT "lesson_materials".* FROM "lesson_materials" WHERE (discipline = 'POR')